NFE/Open NFe Multiempresa/Open NFe Multiempresa/src/RDI.NFe2.Business/Web References/PNF.MS.RetAutorizacao/NfeRetAutorizacao.wsdl

<?xml version="1.0" encoding="utf-8"?>
<definitions xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:tns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeRetAutorizacao" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" name="NfeRetAutorizacao" targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/NfeRetAutorizacao" xmlns="http://schemas.xmlsoap.org/wsdl/">
  <types>
    <xsd:schema>
      <xsd:import schemaLocation="https://nfe.fazenda.ms.gov.br:443/producao/services2/NfeRetAutorizacao?xsd=1" namespace="http://www.portalfiscal.inf.br/nfe/wsdl/NfeRetAutorizacao" />
    </xsd:schema>
  </types>
  <message name="nfeRetAutorizacao">
    <part name="nfeDadosMsg" element="tns:nfeDadosMsg" />
    <part name="nfeCabecMsg" element="tns:nfeCabecMsg" />
  </message>
  <message name="nfeRetAutorizacaoResponse">
    <part name="nfeRetAutorizacaoResult" element="tns:nfeRetAutorizacaoResult" />
    <part name="nfeCabecMsg" element="tns:nfeCabecMsg" />
  </message>
  <portType name="NfeRetAutorizacaoSoap">
    <operation name="nfeRetAutorizacao" parameterOrder="nfeDadosMsg nfeCabecMsg">
      <input wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NfeRetAutorizacao/nfeRetAutorizacao" message="tns:nfeRetAutorizacao" />
      <output wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NfeRetAutorizacao/NfeRetAutorizacaoSoap/nfeRetAutorizacaoResponse" message="tns:nfeRetAutorizacaoResponse" />
    </operation>
  </portType>
  <binding name="nfeRetAutorizacaoSoap12Binding" type="tns:NfeRetAutorizacaoSoap">
    <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="nfeRetAutorizacao">
      <soap12:operation soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NfeRetAutorizacao/nfeRetAutorizacao" />
      <input>
        <soap12:body use="literal" parts="nfeDadosMsg" />
        <soap12:header message="tns:nfeRetAutorizacao" part="nfeCabecMsg" use="literal" />
      </input>
      <output>
        <soap12:body use="literal" parts="nfeRetAutorizacaoResult" />
        <soap12:header message="tns:nfeRetAutorizacaoResponse" part="nfeCabecMsg" use="literal" />
      </output>
    </operation>
  </binding>
  <service name="NfeRetAutorizacao">
    <port name="nfeRetAutorizacaoSoap12" binding="tns:nfeRetAutorizacaoSoap12Binding">
      <soap12:address location="https://nfe.fazenda.ms.gov.br:443/producao/services2/NfeRetAutorizacao" />
    </port>
  </service>
</definitions>